title: Potential CVE-2024-43461 Exploitation Attempt
id: 38d4792c-cbbf-44ed-ada3-e30c974a2bc9
status: experimental
description: |
    Detects potential exploitation of CVE-2024-43461 looking for whitespace patterns in filenames
references:
    - https://msrc.microsoft.com/update-guide/vulnerability/CVE-2024-43461
    - https://www.trendmicro.com/en_us/research/24/g/CVE-2024-38112-void-banshee.html
author: Kev Breen (@kevthehermit)
date: 2024-09-19
tags:
    - cve.2024-43461
logsource:
  product: windows
  category: file_event
detection:
  selection:
    EventID: 11
    TargetFilename|contains: '⠀⠀⠀⠀⠀⠀⠀⠀⠀' # \xe2\xa0\x80\xe2\xa0\x80\xe2\xa0\x80\xe2\xa0\x80\xe2\xa0\x80\xe2\xa0\x80\xe2\xa0\x80\xe2\xa0\x80\xe2\xa0\x80
    TargetFilename|endswith: '.hta'
    ProcessName|contains:
      - mshta.exe
      - iexplore.exe
  condition: selection
falsepositives:
  unknown
level: high